org/t08-08-09-nom.org
#+TITLE:     輪講資料(08) - 乃村研Haskell勉強会2012
#+AUTHOR:    乃村 能成
#+EMAIL:     nom@cs.okayama-u.ac.jp
#+DATE:      2012-06-25
#+SETUPFILE: options/default.org

* Learn You a Haskell for Great Good!
***  [[http://learnyouahaskell.com/making-our-own-types-and-typeclasses][8]]. Making Our Own Types and Typeclasses 
***** A yes-no typeclass
      [[http://learnyouahaskell.com/making-our-own-types-and-typeclasses#a-yes-no-typeclass][(http://learnyouahaskell.com/making-our-own-types-and-typeclasses#a-yes-no-typeclass)]]

      JavaScript の =True/False= っぽい振舞いをする型クラスを作ってみよう．
      + JavaScript の =if= は，条件文内が空でない文字列なら真
      + Haskell であれば， =Bool= を使うところ
      #+begin_src haskell
        class YesNo a where
          yesno :: a -> Bool
      #+end_src
      + =YesNo= 型クラスは， =yesno= という1つの関数を定義している
      + =a= 型の値を1つ取り，それが真っぽい値だったら， =True= を返す

      次は，型クラスのインスタンス定義．
      数に関していえば，JS のように非 =0= を真とするのが自然．
      #+BEGIN_SRC haskell
        instance YesNo Int where
          yesno 0 = False
          yesno _ = True
      #+END_SRC

      リスト(そして文字列)の場合は，それが空なら偽．
      #+BEGIN_SRC haskell
        instance YesNo [a] where
          yesno [] = False
          yesno _ = True
      #+END_SRC
      ここで，リスト内の =a= の具象データ型を指定していないことに注目して．
      =Bool= 型は，そのままいける．
      #+BEGIN_SRC haskell
        instance YesNo Bool where
          yesno = id
      #+END_SRC
      ここで， =id= とは?
      これは，引数を1つだけ取って，同じものを返すだけの関数．
      つまり，以下は同等．
      #+BEGIN_EXAMPLE
        yesno True
        id True
        True
      #+END_EXAMPLE

      =Maybe a= もインスタンスにしてみよう．
      #+BEGIN_SRC haskell
        instance YesNo (Maybe a) where
          yesno (Just _) = True
          yesno Nothing = False
      #+END_SRC
      ここで， =a= についての型クラス制約は不要．
      なぜなら， =Just= と =Nothing= だけで =True/False= を決めているから．
      ただ， =Maybe= だけではだめで， =Maybe a= と書く必要があります．
      =Maybe= だけでは具象データ型ではないので．

      先に定義した =Tree a= 型(二分探索木)については，空の木を =False=
      としましょう．
      #+BEGIN_SRC haskell
        instance YesNo (Tree a) where
          yesno EmptyTree = False
          yesno _ = True
      #+END_SRC

      信号機はどうだろう? 黄色は進めってことで，
      #+BEGIN_SRC haskell
        instance YesNo TrafficLight where
          yesno Red = False
          yesno _ = True
      #+END_SRC

      インスタンスが揃ったので，遊んでみよう．
      #+BEGIN_EXAMPLE
        ghci> yesno $ length []  
        False  
        ghci> yesno "haha"  
        True  
        ghci> yesno ""  
        False  
        ghci> yesno $ Just 0  
        True  
        ghci> yesno True  
        True  
        ghci> yesno EmptyTree  
        False  
        ghci> yesno []  
        False  
        ghci> yesno [0,0,0]  
        True  
        ghci> :t yesno  
        yesno :: (YesNo a) => a -> Bool  
      #+END_EXAMPLE
      うまくいってる．

      では， =if= 文を模倣してみよう．
      ただし， =YesNo= 型クラスのインスタンスを引数に取る．

      #+BEGIN_SRC haskell
        yesnoIf :: (YesNo y) => y -> a -> a -> a
        yesnoIf yesnoVal yesResult noResult = if yesno yesnoVal 
                                              then yesResult 
                                              else noResult
      #+END_SRC
      この関数は， =YesNo= な値とあと2つの引数を取り，Yes っぽければ，
      2つの引数の前者，そうでないなら，後者を返します．
      #+BEGIN_EXAMPLE
        ghci> yesnoIf [] "YEAH!" "NO!"
        "NO!"
        ghci> yesnoIf [2,3,4] "YEAH!" "NO!"
        "YEAH!"
        ghci> yesnoIf True "YEAH!" "NO!"
        "YEAH!"
        ghci> yesnoIf (Just 500) "YEAH!" "NO!"
        "YEAH!"
        ghci> yesnoIf Nothing "YEAH!" "NO!"
        "NO!"
      #+END_EXAMPLE

