html/t08-08-09-nom.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>輪講資料(08) - 乃村研Haskell勉強会2012</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="輪講資料(08) - 乃村研Haskell勉強会2012"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-25"/>
<meta name="author" content="乃村 能成"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="pub/css/text.css">


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">輪講資料(08) - 乃村研Haskell勉強会2012</h1>


<div id="table-of-contents">
<h2>目次</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Learn You a Haskell for Great Good!</a>
<ul>
<li><a href="#sec-1-1">8. Making Our Own Types and Typeclasses</a>
<ul>
<li><a href="#sec-1-1-1">A yes-no typeclass</a></li>
<li><a href="#sec-1-1-2">The Functor typeclass</a></li>
<li><a href="#sec-1-1-3">Kinds and some type-foo</a></li>
</ul>
</li>
<li><a href="#sec-1-2">9. Input and Output</a>
<ul>
<li><a href="#sec-1-2-1">Hello, world!</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Learn You a Haskell for Great Good!</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><a href="http://learnyouahaskell.com/making-our-own-types-and-typeclasses">8</a>. Making Our Own Types and Typeclasses</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">A yes-no typeclass</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>      <a href="http://learnyouahaskell.com/making-our-own-types-and-typeclasses#a-yes-no-typeclass">(http://learnyouahaskell.com/making-our-own-types-and-typeclasses#a-yes-no-typeclass)</a>
</p>
<p>
      JavaScript の <code>True/False</code> っぽい振舞いをする型クラスを作ってみよう．
</p><ul>
<li>JavaScript の <code>if</code> は，条件文内が空でない文字列なら真
</li>
<li>Haskell であれば， <code>Bool</code> を使うところ
</li>
</ul>




<pre class="src src-haskell"><span style="color: #7f007f;">class</span> <span style="color: #228b22;">YesNo</span> a <span style="color: #7f007f;">where</span>
  yesno <span style="color: #a0522d;">::</span> a <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">Bool</span>
</pre>

<ul>
<li><code>YesNo</code> 型クラスは， <code>yesno</code> という1つの関数を定義している
</li>
<li><code>a</code> 型の値を1つ取り，それが真っぽい値だったら， <code>True</code> を返す
</li>
</ul>


<p>
      次は，型クラスのインスタンス定義．
      数に関していえば，JS のように非 <code>0</code> を真とするのが自然．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">YesNo</span> <span style="color: #228b22;">Int</span> <span style="color: #7f007f;">where</span>
  yesno 0 <span style="color: #a0522d;">=</span> <span style="color: #228b22;">False</span>
  yesno <span style="color: #7f007f;">_</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">True</span>
</pre>


<p>
      リスト(そして文字列)の場合は，それが空なら偽．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">YesNo</span> [a] <span style="color: #7f007f;">where</span>
  yesno <span style="color: #228b22;">[]</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">False</span>
  yesno <span style="color: #7f007f;">_</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">True</span>
</pre>

<p>
      ここで，リスト内の <code>a</code> の具象データ型を指定していないことに注目して．
      <code>Bool</code> 型は，そのままいける．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">YesNo</span> <span style="color: #228b22;">Bool</span> <span style="color: #7f007f;">where</span>
  yesno <span style="color: #a0522d;">=</span> id
</pre>

<p>
      ここで， <code>id</code> とは?
      これは，引数を1つだけ取って，同じものを返すだけの関数．
      つまり，以下は同等．
</p>


<pre class="example">yesno True
id True
True
</pre>


<p>
      <code>Maybe a</code> もインスタンスにしてみよう．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">YesNo</span> (<span style="color: #228b22;">Maybe</span> a) <span style="color: #7f007f;">where</span>
  yesno (<span style="color: #228b22;">Just</span> <span style="color: #7f007f;">_</span>) <span style="color: #a0522d;">=</span> <span style="color: #228b22;">True</span>
  yesno <span style="color: #228b22;">Nothing</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">False</span>
</pre>

<p>
      ここで， <code>a</code> についての型クラス制約は不要．
      なぜなら， <code>Just</code> と <code>Nothing</code> だけで <code>True/False</code> を決めているから．
      ただ， <code>Maybe</code> だけではだめで， <code>Maybe a</code> と書く必要があります．
      <code>Maybe</code> だけでは具象データ型ではないので．
</p>
<p>
      先に定義した <code>Tree a</code> 型(二分探索木)については，空の木を <code>False</code>
      としましょう．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">YesNo</span> (<span style="color: #228b22;">Tree</span> a) <span style="color: #7f007f;">where</span>
  yesno <span style="color: #228b22;">EmptyTree</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">False</span>
  yesno <span style="color: #7f007f;">_</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">True</span>
</pre>


<p>
      信号機はどうだろう? 黄色は進めってことで，
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">YesNo</span> <span style="color: #228b22;">TrafficLight</span> <span style="color: #7f007f;">where</span>
  yesno <span style="color: #228b22;">Red</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">False</span>
  yesno <span style="color: #7f007f;">_</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">True</span>
</pre>


<p>
      インスタンスが揃ったので，遊んでみよう．
</p>


<pre class="example">ghci&gt; yesno $ length []  
False  
ghci&gt; yesno "haha"  
True  
ghci&gt; yesno ""  
False  
ghci&gt; yesno $ Just 0  
True  
ghci&gt; yesno True  
True  
ghci&gt; yesno EmptyTree  
False  
ghci&gt; yesno []  
False  
ghci&gt; yesno [0,0,0]  
True  
ghci&gt; :t yesno  
yesno :: (YesNo a) =&gt; a -&gt; Bool  
</pre>

<p>
      うまくいってる．
</p>
<p>
      では， <code>if</code> 文を模倣してみよう．
      ただし， <code>YesNo</code> 型クラスのインスタンスを引数に取る．
</p>



<pre class="src src-haskell"><span style="color: #0000ff;">yesnoIf</span> <span style="color: #a0522d;">::</span> (<span style="color: #228b22;">YesNo</span> y) <span style="color: #a0522d;">=&gt;</span> y <span style="color: #a0522d;">-&gt;</span> a <span style="color: #a0522d;">-&gt;</span> a <span style="color: #a0522d;">-&gt;</span> a
<span style="color: #0000ff;">yesnoIf</span> yesnoVal yesResult noResult <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">if</span> yesno yesnoVal 
                                      <span style="color: #7f007f;">then</span> yesResult 
                                      <span style="color: #7f007f;">else</span> noResult
</pre>

<p>
      この関数は， <code>YesNo</code> な値とあと2つの引数を取り，Yes っぽければ，
      2つの引数の前者，そうでないなら，後者を返します．
</p>


<pre class="example">ghci&gt; yesnoIf [] "YEAH!" "NO!"
"NO!"
ghci&gt; yesnoIf [2,3,4] "YEAH!" "NO!"
"YEAH!"
ghci&gt; yesnoIf True "YEAH!" "NO!"
"YEAH!"
ghci&gt; yesnoIf (Just 500) "YEAH!" "NO!"
"YEAH!"
ghci&gt; yesnoIf Nothing "YEAH!" "NO!"
"NO!"
</pre>


</div>

</div>
