org/t08-08-09-nom.org
***** The Functor typeclass
      [[http://learnyouahaskell.com/making-our-own-types-and-typeclasses#the-functor-typeclass][(http://learnyouahaskell.com/making-our-own-types-and-typeclasses#the-functor-typeclass)]]

      これまで，標準ライブラリの型クラスを見てきました．
      + Ord :: 順番付けできる型のクラス
      + Eq :: 同値関係を判定できる型のクラス
      + Show :: 文字列で方言できる型のクラス
      + Read :: 文字列から変換可能な型のクラス
      ここで， =Functor= 型クラスを見ます．
      Functor は，(リストのように)マップ可能な何かを表わしています．
      実装を覗いてみると:
      #+BEGIN_SRC haskell
        class Functor f where
          fmap :: (a -> b) -> f a -> f b
      #+END_SRC
      =fmap= 関数は，これまで見てきた関数とは，ちょっと違います．
      なぜなら， =f a= の =f= は，具象データ型ではなく，
      =a= という型を引数に取る型構成子だからです．

      つまり， =f= は， =Int=, =Bool=, =Maybe String= が持つような値を持たない．
      たとえば， =Maybe Int= は具象データ型だけど， =Maybe= は，具象データ型
      (ここでは =Int= ) を取る型構成子です．(訳注: リスト =[a]= は =[] a= と書けるよね)

      とにかく， =fmap= は，ある型から別の型を得る関数と，
      ある型が適用された Functor を取り，別の型が適用された Functor を返すのです．
      =map= 関数の型シグネチャと比較してみるとよく分かります．
      #+BEGIN_SRC haskell
        map :: (a -> b) -> [a] -> [b]
      #+END_SRC
      つまり， =map= は，リスト限定の =fmap= なのです．
      リストを Functor のインスタンスにするには，以下のようにします．
      #+BEGIN_SRC haskell
        instance Functor [] where
          fmap = map
      #+END_SRC
      =instance Functor [a]= ではないことに注意．
      =fmap :: (a -> b) -> f a -> f b= を見ると分かるように，
      =f= は，別の型を1つ取る型構成子だからです．
      =[a]= は具象データ型なのに対して， =[]= は， =[Int]= や =[String]= や =[[String] ]= さえ作る
      型構成子なのです．

      リストの =fmap= は =map= と同じです．
      #+BEGIN_EXAMPLE
        map :: (a -> b) -> [a] -> [b]
        ghci> fmap (*2) [1..3]
        [2,4,6]
        ghci> map (*2) [1..3]
        [2,4,6]
      #+END_EXAMPLE

      箱のように振舞う型が Functor です．リストは無限に続く小部屋です．他に箱っぽいものは?
      =Maybe a= がそうです:
      + 中に何も入っていなければ， =Nothing=
      + "HAHA" が入っていれば， =Just= "HAHA"
      定義を見ると:
      #+BEGIN_SRC haskell
        instance Functor Maybe where
          fmap f (Just x) = Just (f x)
          fmap f Nothing = Nothing
      #+END_SRC
      しつこいけど， =instance Functor Maybe= です =instance Functor (Maybe m)= じゃなくてね．

      心の中で =f s= を =Maybe s= に置き換えると，
      =fmap= は， =(a -> b) -> Maybe a -> Maybe b=
      となり，OKです．しかし， =f= を =(Maybe m)= で置き換えると，
      =(a -> b) -> Maybe m a -> Maybe m b= となって変です．
      なぜなら， =Maybe= は，1つしか引数を取らないからです．

      とにかく， =fmap= の実装は，とてもシンプルでしょ．
      =Nothing= という空の値なら， =Nothing= を返します．
      空の箱からは，空の箱．もし， =Just= 付きの値であれば，
      その =Just= の中の値に =f= を適用する．

      #+BEGIN_EXAMPLE
        ghci> fmap (++ " HEY GUYS IM INSIDE THE JUST") (Just "Something serious.")
        Just "Something serious. HEY GUYS IM INSIDE THE JUST"
        ghci> fmap (++ " HEY GUYS IM INSIDE THE JUST") Nothing
        Nothing
        ghci> fmap (*2) (Just 200)
        Just 400
        ghci> fmap (*2) Nothing
        Nothing
      #+END_EXAMPLE
      
      別の Functor の例に， =Tree a= 型があります．
      =Tree= も見方によっては，箱と考えることができますし，
      =Tree= のコンストラクタは，引数を1つ取るからです．
      =fmap= を =Tree= 専用の関数だと思って見ると， =fmap= のシグネチャは，
      =(a -> b) -> Tree a -> Tree b= となります．
      ここでの =fmap= は，再帰で書けそうです．
      + 空の木に関しては，空を返す
      + 空でないなら
        + ルートノードは，もとのルートノードに =f= を適用したもの
        + 左部分木は，元の左部分木に =fmap= を適用したもの
        + 右部分木は，元の右部分木に =fmap= を適用したもの
      となりそうです．

      #+BEGIN_SRC haskell
        instance Functor Tree where
          fmap f EmptyTree = EmptyTree
          fmap f (Node x leftsub rightsub) = 
            Node (f x) (fmap f leftsub) (fmap f rightsub)
      #+END_SRC
      ナイス!

      では， =Either a b= はどう? Functor になれそう?
      =Either= は引数を2つ取るので，これまでとちょっと違います．
      でも， =Either= に引数を1つだけ与えた状態(部分適用した状態) なら?
      標準ライブラリ中でどのように =Either= が Functor になっているか見てみると:

      #+BEGIN_SRC haskell
        instance Functor (Either a) where
          fmap f (Right x) = Right (f x)
          fmap f (Left x) = Left x
      #+END_SRC

      =Either a= が Functor のインスタンスになっていいます．
      =Either= ではないのです．
      型シグネチャも =(b -> c) -> Either a b -> Either a c= となります．

      この実装を見ると， =Right= しか面倒を見ていません．なぜでしょう．
      =Either a b= 型がどう定義されているか思い出してみると:
      #+BEGIN_SRC haskell
        data Either a b = Left a | Right b
      #+END_SRC

      もし両方に =f= を適用したいと思ったら，
      =a= と =b= の型は同じでなくてはなりません．
      もし， =a= が数値で， =b= が文字列だった場合はうまく動きません．
      =fmap= が =Either= を操作する場合は，
      1つ目の引数は変化していないのに対して，2つ目は変化しています．
      1つ目のパラメータは， =Left= 値構成子によって実体化されていることも分かります．

      
      =Data.Map= の関数(連想配列)も =Functor= といえます．値を保持しているからです．
      =Map k v= の場合， =fmap= は，
      : v -> v'
      という関数を取り，
      : Map k v
      について適用して
      : Map k v'
      を返します．
      どういうわけで =Map k= が =Functor= の一員になるのかについては，自分で確認してみてください．

      =Functor= を取り上げて，型クラスが如何に高次の概念を表現しうるかについて見てきました．
      また，型を部分適用したり，型クラスのインスタンスを作ることも練習しました．
      後の章では， =Functor= が満たすべき条件についても見てみます．

