html/t08-08-09-nom.html

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">The Functor typeclass</h4>
<div class="outline-text-4" id="text-1-1-2">

<p>      <a href="http://learnyouahaskell.com/making-our-own-types-and-typeclasses#the-functor-typeclass">(http://learnyouahaskell.com/making-our-own-types-and-typeclasses#the-functor-typeclass)</a>
</p>
<p>
      これまで，標準ライブラリの型クラスを見てきました．
</p><dl>
<dt>Ord</dt><dd>順番付けできる型のクラス
</dd>
<dt>Eq</dt><dd>同値関係を判定できる型のクラス
</dd>
<dt>Show</dt><dd>文字列で方言できる型のクラス
</dd>
<dt>Read</dt><dd>文字列から変換可能な型のクラス
</dd>
</dl>

<p>      ここで， <code>Functor</code> 型クラスを見ます．
      Functor は，(リストのように)マップ可能な何かを表わしています．
      実装を覗いてみると:
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">class</span> <span style="color: #228b22;">Functor</span> f <span style="color: #7f007f;">where</span>
  fmap <span style="color: #a0522d;">::</span> (a <span style="color: #a0522d;">-&gt;</span> b) <span style="color: #a0522d;">-&gt;</span> f a <span style="color: #a0522d;">-&gt;</span> f b
</pre>

<p>
      <code>fmap</code> 関数は，これまで見てきた関数とは，ちょっと違います．
      なぜなら， <code>f a</code> の <code>f</code> は，具象データ型ではなく，
      <code>a</code> という型を引数に取る型構成子だからです．
</p>
<p>
      つまり， <code>f</code> は， <code>Int</code>, <code>Bool</code>, <code>Maybe String</code> が持つような値を持たない．
      たとえば， <code>Maybe Int</code> は具象データ型だけど， <code>Maybe</code> は，具象データ型
      (ここでは <code>Int</code> ) を取る型構成子です．(訳注: リスト <code>[a]</code> は <code>[] a</code> と書けるよね)
</p>
<p>
      とにかく， <code>fmap</code> は，ある型から別の型を得る関数と，
      ある型が適用された Functor を取り，別の型が適用された Functor を返すのです．
      <code>map</code> 関数の型シグネチャと比較してみるとよく分かります．
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">map</span> <span style="color: #a0522d;">::</span> (a <span style="color: #a0522d;">-&gt;</span> b) <span style="color: #a0522d;">-&gt;</span> [a] <span style="color: #a0522d;">-&gt;</span> [b]
</pre>

<p>
      つまり， <code>map</code> は，リスト限定の <code>fmap</code> なのです．
      リストを Functor のインスタンスにするには，以下のようにします．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">Functor</span> <span style="color: #228b22;">[]</span> <span style="color: #7f007f;">where</span>
  fmap <span style="color: #a0522d;">=</span> map
</pre>

<p>
      <code>instance Functor [a]</code> ではないことに注意．
      <code>fmap :: (a -&gt; b) -&gt; f a -&gt; f b</code> を見ると分かるように，
      <code>f</code> は，別の型を1つ取る型構成子だからです．
      <code>[a]</code> は具象データ型なのに対して， <code>[]</code> は， <code>[Int]</code> や <code>[String]</code> や <code>[[String] ]</code> さえ作る
      型構成子なのです．
</p>
<p>
      リストの <code>fmap</code> は <code>map</code> と同じです．
</p>


<pre class="example">map :: (a -&gt; b) -&gt; [a] -&gt; [b]
ghci&gt; fmap (*2) [1..3]
[2,4,6]
ghci&gt; map (*2) [1..3]
[2,4,6]
</pre>


<p>
      箱のように振舞う型が Functor です．リストは無限に続く小部屋です．他に箱っぽいものは?
      <code>Maybe a</code> がそうです:
</p><ul>
<li>中に何も入っていなければ， <code>Nothing</code>
</li>
<li>"HAHA" が入っていれば， <code>Just</code> "HAHA"
</li>
</ul>

<p>      定義を見ると:
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">Functor</span> <span style="color: #228b22;">Maybe</span> <span style="color: #7f007f;">where</span>
  fmap f (<span style="color: #228b22;">Just</span> x) <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Just</span> (f x)
  fmap f <span style="color: #228b22;">Nothing</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Nothing</span>
</pre>

<p>
      しつこいけど， <code>instance Functor Maybe</code> です <code>instance Functor (Maybe m)</code> じゃなくてね．
</p>
<p>
      心の中で <code>f s</code> を <code>Maybe s</code> に置き換えると，
      <code>fmap</code> は， <code>(a -&gt; b) -&gt; Maybe a -&gt; Maybe b</code>
      となり，OKです．しかし， <code>f</code> を <code>(Maybe m)</code> で置き換えると，
      <code>(a -&gt; b) -&gt; Maybe m a -&gt; Maybe m b</code> となって変です．
      なぜなら， <code>Maybe</code> は，1つしか引数を取らないからです．
</p>
<p>
      とにかく， <code>fmap</code> の実装は，とてもシンプルでしょ．
      <code>Nothing</code> という空の値なら， <code>Nothing</code> を返します．
      空の箱からは，空の箱．もし， <code>Just</code> 付きの値であれば，
      その <code>Just</code> の中の値に <code>f</code> を適用する．
</p>



<pre class="example">ghci&gt; fmap (++ " HEY GUYS IM INSIDE THE JUST") (Just "Something serious.")
Just "Something serious. HEY GUYS IM INSIDE THE JUST"
ghci&gt; fmap (++ " HEY GUYS IM INSIDE THE JUST") Nothing
Nothing
ghci&gt; fmap (*2) (Just 200)
Just 400
ghci&gt; fmap (*2) Nothing
Nothing
</pre>


<p>      
      別の Functor の例に， <code>Tree a</code> 型があります．
      <code>Tree</code> も見方によっては，箱と考えることができますし，
      <code>Tree</code> のコンストラクタは，引数を1つ取るからです．
      <code>fmap</code> を <code>Tree</code> 専用の関数だと思って見ると， <code>fmap</code> のシグネチャは，
      <code>(a -&gt; b) -&gt; Tree a -&gt; Tree b</code> となります．
      ここでの <code>fmap</code> は，再帰で書けそうです．
</p><ul>
<li>空の木に関しては，空を返す
</li>
<li>空でないなら
<ul>
<li>ルートノードは，もとのルートノードに <code>f</code> を適用したもの
</li>
<li>左部分木は，元の左部分木に <code>fmap</code> を適用したもの
</li>
<li>右部分木は，元の右部分木に <code>fmap</code> を適用したもの
</li>
</ul>

</li>
</ul>

<p>      となりそうです．
</p>



<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">Functor</span> <span style="color: #228b22;">Tree</span> <span style="color: #7f007f;">where</span>
  fmap f <span style="color: #228b22;">EmptyTree</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">EmptyTree</span>
  fmap f (<span style="color: #228b22;">Node</span> x leftsub rightsub) <span style="color: #a0522d;">=</span> 
    <span style="color: #228b22;">Node</span> (f x) (fmap f leftsub) (fmap f rightsub)
</pre>

<p>
      ナイス!
</p>
<p>
      では， <code>Either a b</code> はどう? Functor になれそう?
      <code>Either</code> は引数を2つ取るので，これまでとちょっと違います．
      でも， <code>Either</code> に引数を1つだけ与えた状態(部分適用した状態) なら?
      標準ライブラリ中でどのように <code>Either</code> が Functor になっているか見てみると:
</p>



<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">Functor</span> (<span style="color: #228b22;">Either</span> a) <span style="color: #7f007f;">where</span>
  fmap f (<span style="color: #228b22;">Right</span> x) <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Right</span> (f x)
  fmap f (<span style="color: #228b22;">Left</span> x) <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Left</span> x
</pre>


<p>
      <code>Either a</code> が Functor のインスタンスになっていいます．
      <code>Either</code> ではないのです．
      型シグネチャも <code>(b -&gt; c) -&gt; Either a b -&gt; Either a c</code> となります．
</p>
<p>
      この実装を見ると， <code>Right</code> しか面倒を見ていません．なぜでしょう．
      <code>Either a b</code> 型がどう定義されているか思い出してみると:
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">data</span> <span style="color: #228b22;">Either</span> a b <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Left</span> a <span style="color: #a0522d;">|</span> <span style="color: #228b22;">Right</span> b
</pre>


<p>
      もし両方に <code>f</code> を適用したいと思ったら，
      <code>a</code> と <code>b</code> の型は同じでなくてはなりません．
      もし， <code>a</code> が数値で， <code>b</code> が文字列だった場合はうまく動きません．
      <code>fmap</code> が <code>Either</code> を操作する場合は，
      1つ目の引数は変化していないのに対して，2つ目は変化しています．
      1つ目のパラメータは， <code>Left</code> 値構成子によって実体化されていることも分かります．
</p>

<p>      
      <code>Data.Map</code> の関数(連想配列)も <code>Functor</code> といえます．値を保持しているからです．
      <code>Map k v</code> の場合， <code>fmap</code> は，
</p><pre class="example">
v -&gt; v'
</pre>

<p>      という関数を取り，
</p><pre class="example">
Map k v
</pre>

<p>      について適用して
</p><pre class="example">
Map k v'
</pre>

<p>      を返します．
      どういうわけで <code>Map k</code> が <code>Functor</code> の一員になるのかについては，自分で確認してみてください．
</p>
<p>
      <code>Functor</code> を取り上げて，型クラスが如何に高次の概念を表現しうるかについて見てきました．
      また，型を部分適用したり，型クラスのインスタンスを作ることも練習しました．
      後の章では， <code>Functor</code> が満たすべき条件についても見てみます．
</p>
</div>

</div>
