org/t08-08-09-nom.org
***** Kinds and some type-foo
      [[http://learnyouahaskell.com/making-our-own-types-and-typeclasses#kinds-and-some-type-foo][(http://learnyouahaskell.com/making-our-own-types-and-typeclasses#kinds-and-some-type-foo)]]

      型構成子は，他の型を引数に取って具象データ型を作ります．
      この振舞いは，関数に引数を適用して値を得ることを想起させます．
      どちらも部分適用が可能です．ここでは，型がどのように型構成子に適用されるかについて見てみます．
      これは，これまで私達が見てきた，値がどのように関数に適用されるかと同じです．
      ここの節に書いてある事が当面理解できなくても問題ないですが，
      理解できると，型システム関する一貫した見通しを得られることでしょう．
      3 や "YEAR" ， =takeWhile= (関数)も何らかの型を持っています．
      型とは，値に付けられたラベルで，
      それによって，値に対する理(ことわり)を得ます．

      型も同様にラベルを持っていて，それをカインド( *kind* ) と呼びます．
      カインドは，だいたい，型の型という感じです．
      混乱しそうですが，実にクールなコンセプトです．
      カインドは，何で，何に役に立つ? GHCI に =:k= コマンドを投げてみましょう．
      #+BEGIN_SRC haskell
        ghci> :k Int  
        Int :: *  
      #+END_SRC
      星?(=*=)． =*= は，この型は具象データ型であることを示しています．
      具象データ型は，型引数を取らない型です．
      すべての値(value)は，何らかの具象データ型に属しています．
      =*= を声に出して読むなら，「型(type)」か「スター(*)」でしょうね．

      では， =Maybe= は?
      #+BEGIN_SRC haskell
        ghci> :k Maybe  
        Maybe :: * -> *  
      #+END_SRC

      これから分かることは，
      =Maybe= 型構成子は，1つの具象データ型(たとえば， =Int= ) を引数に取り，
      =Maybe Int= のような具象データ型を返すということです．

      =Int -> Int= が =Int= 型の引数を取って =Int= 型の値を返すのと同じように，
      =* -> *= は，具象データ型を引数に取って，具象データ型を返すと解釈します．
      
      では， =Maybe= に型引数を適用して，カインドがどうなるか確認します．
      #+BEGIN_SRC haskell
        ghci> :k Maybe Int  
        Maybe Int :: *  
      #+END_SRC

      思った通り．これは，以下の2つの関係に似ています．
      : :t isUpper
      : :t isUpper 'A'

      別のカインドを確認してみます．
      #+BEGIN_SRC haskell
        ghci> :k Either  
        Either :: * -> * -> *  
      #+END_SRC
      部分適用をして，
      #+BEGIN_SRC haskell
        ghci> :k Either String
        Either String :: * -> *
        ghci> :k Either String Int
        Either String Int :: *
      #+END_SRC
      =Either= を =Functor= 型クラスにしたときに部分適用を使いましたね．
      なぜなら， =Functor= は，型引数を1つ取るのに対して， =Either= は2つだったからですよね．
      言い換えると， =Functor= は =* -> *= なるカインドを欲っしています．
      しかし， =Either= は， =* -> * -> *= なので，
      =Either= に部分適用させて =* -> *= を得るのです．
      
      ここで，もう一度 =Functor= の定義について見てみます．
      #+BEGIN_SRC haskell
        class Functor f where   
          fmap :: (a -> b) -> f a -> f b        
      #+END_SRC
      =f= なる型引数は，1つの具象データ型を引数に取って，
      具象データ型を作ることが分かります．

      ここまで学んだ知識を使えば，
      =Functor= と友達になりたい型は， =* -> *= というカインドを持たなければならないと分かります．

      カインドを意識して，何か作ってみましょう．
      #+BEGIN_SRC haskell
        class Tofu t where  
          tofu :: j a -> t a j  
      #+END_SRC
      + =j a= は =tofu= の引数なので，具象データ型のはずです．
        つまり， =*= です． =a= が =*= だと仮定すると，
        =j= は =* -> *= です．
      + =t a j= もまた =*= であるはずです．
      + =a= は =*= で， =j= は =* -> *= なので，
        =t= は =* -> (* -> *) -> *= でしょう．
      OK．では， =* -> (* -> *) -> *= なるカインドを持つ型を作ってみましょう．
      #+BEGIN_SRC haskell
        data Frank a b  = Frank {frankField :: b a} deriving (Show)
      #+END_SRC
      この代数データ型 (ADT: algebraic data type) のフィールドは，データを保持するのに利用されるので，
      カインド =*= でなければなりません．
      つまり =a= を =*= だとすると， =b= は 1つの型引数を取るので， =* -> *= となります．
      =Frank= は， =a= と =b= を引数として取るので， =Frank= 
      は =* -> (* -> *) -> *= となります．ここで，最初の =*= は =a= で， =(* -> *)= は， =b=
      です． ここで =Frank= 型の値を定義してその型をチェックしてみましょう．

      #+BEGIN_SRC haskell
        ghci> :t Frank {frankField = Just "HAHA"}
        Frank {frankField = Just "HAHA"} :: Frank [Char] Maybe
        ghci> :t Frank {frankField = Node 'a' EmptyTree EmptyTree}
        Frank {frankField = Node 'a' EmptyTree EmptyTree} :: Frank Char Tree
        ghci> :t Frank {frankField = "YES"}
        Frank {frankField = "YES"} :: Frank Char []
      #+END_SRC

      =frankField= は =a b= なる型なので，値の型も似た形になるはず．
      =たとえば Just "HAHA" で= =Maybe [Char]= 型や =['Y', 'E', 'S']= で =[Char]= 型のような値を持つことができます．
      =Frank= 型の値は， =Frank= のカインドと一致しています． =[Char]= は， =*= というカインドで，
      =Maybe= は， =* -> *= です．
      全ての =Frank blah blaah= のカインドは， =*= です．
      
      =Frank= を =Tofu= のインスタンスにするのは簡単です． =tofu= は =j a= を取って，(例えば =Maybe Int=) そして，
      =t a j= を返します．したがって， =Frank= を =t= (原文は =j= だが，おそらく間違い) と置けば，
      結果の型は =Frank Int Maybe= です．

      #+BEGIN_SRC haskell
        instance Tofu Frank where
          tofu x = Frank x
      #+END_SRC

      #+BEGIN_SRC haskell
        ghci> tofu (Just 'a') :: Frank Char Maybe
        Frank {frankField = Just 'a'}
        ghci> tofu ["HELLO"] :: Frank [Char] []
        Frank {frankField = ["HELLO"]}
        ghci> :t Frank (Just "HAHA")
        Frank (Just "HAHA") :: Frank [Char] Maybe
      #+END_SRC

      もう少し訓練してみます．

      #+BEGIN_SRC haskell
        data Barry t k p = Barry { yabba :: p, dabba :: t k }
      #+END_SRC
      これを =Functor= の一員にしたいとします． =Functor= のカインドは， =* -> *=  ですが，
      =Barry= は，違います． =Barry= のカインドは何でしょうか?
      =something -> something -> something -> *= となります．
      =p= は =*= でしょうね(ADTのフィールドなので)．
      =k= も =*= と仮定すると，
      =t= は =* -> *= です．
      =something= を置き換えると，
      =(* -> *) -> * -> * -> *= です．GHCI で調べてみると，
      #+BEGIN_SRC haskell
        ghci> :k Barry
        Barry :: (* -> *) -> * -> * -> *
      #+END_SRC
      思った通りだ．満足．
      
      そうすると， =Functor= の要求するカインド =* -> *= に合わせるためには，最初の2つを食べさせことになるので，
      インスタンス定義の書き出しは，以下のようになるはず:
      #+BEGIN_SRC haskell
        instance Functor (Barry a b) where...
      #+END_SRC

      =fmap= の定義を =Barry= 用だと思って眺めると，
      =fmap :: (a -> b) -> Barry c d a -> Barry c d b= のように見える．
      =Functor= の =f= を =Barry c d= に置き換えただけ．
      #+BEGIN_SRC haskell
        instance Functor (Barry a b) where
          fmap f (Barry {yabba = x, dabba = y}) = 
            Barry {yabba = f x, dabba = y}
      #+END_SRC
      =f= は，最初のフィールドにだけmapすると分かる．

