html/t08-08-09-nom.html

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Kinds and some type-foo</h4>
<div class="outline-text-4" id="text-1-1-3">

<p>      <a href="http://learnyouahaskell.com/making-our-own-types-and-typeclasses#kinds-and-some-type-foo">(http://learnyouahaskell.com/making-our-own-types-and-typeclasses#kinds-and-some-type-foo)</a>
</p>
<p>
      型構成子は，他の型を引数に取って具象データ型を作ります．
      この振舞いは，関数に引数を適用して値を得ることを想起させます．
      どちらも部分適用が可能です．ここでは，型がどのように型構成子に適用されるかについて見てみます．
      これは，これまで私達が見てきた，値がどのように関数に適用されるかと同じです．
      ここの節に書いてある事が当面理解できなくても問題ないですが，
      理解できると，型システム関する一貫した見通しを得られることでしょう．
      3 や "YEAR" ， <code>takeWhile</code> (関数)も何らかの型を持っています．
      型とは，値に付けられたラベルで，
      それによって，値に対する理(ことわり)を得ます．
</p>
<p>
      型も同様にラベルを持っていて，それをカインド( <b>kind</b> ) と呼びます．
      カインドは，だいたい，型の型という感じです．
      混乱しそうですが，実にクールなコンセプトです．
      カインドは，何で，何に役に立つ? GHCI に <code>:k</code> コマンドを投げてみましょう．
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>k <span style="color: #228b22;">Int</span>  
<span style="color: #228b22;">Int</span> <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">*</span>  
</pre>

<p>
      星?(<code>*</code>)． <code>*</code> は，この型は具象データ型であることを示しています．
      具象データ型は，型引数を取らない型です．
      すべての値(value)は，何らかの具象データ型に属しています．
      <code>*</code> を声に出して読むなら，「型(type)」か「スター(*)」でしょうね．
</p>
<p>
      では， <code>Maybe</code> は?
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>k <span style="color: #228b22;">Maybe</span>  
<span style="color: #228b22;">Maybe</span> <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">*</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #a0522d;">*</span>  
</pre>


<p>
      これから分かることは，
      <code>Maybe</code> 型構成子は，1つの具象データ型(たとえば， <code>Int</code> ) を引数に取り，
      <code>Maybe Int</code> のような具象データ型を返すということです．
</p>
<p>
      <code>Int -&gt; Int</code> が <code>Int</code> 型の引数を取って <code>Int</code> 型の値を返すのと同じように，
      <code>* -&gt; *</code> は，具象データ型を引数に取って，具象データ型を返すと解釈します．
</p>
<p>      
      では， <code>Maybe</code> に型引数を適用して，カインドがどうなるか確認します．
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>k <span style="color: #228b22;">Maybe</span> <span style="color: #228b22;">Int</span>  
<span style="color: #228b22;">Maybe</span> <span style="color: #228b22;">Int</span> <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">*</span>  
</pre>


<p>
      思った通り．これは，以下の2つの関係に似ています．
</p><pre class="example">
:t isUpper
:t isUpper 'A'
</pre>


<p>
      別のカインドを確認してみます．
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>k <span style="color: #228b22;">Either</span>  
<span style="color: #228b22;">Either</span> <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">*</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #a0522d;">*</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #a0522d;">*</span>  
</pre>

<p>
      部分適用をして，
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>k <span style="color: #228b22;">Either</span> <span style="color: #228b22;">String</span>
<span style="color: #228b22;">Either</span> <span style="color: #228b22;">String</span> <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">*</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #a0522d;">*</span>
ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>k <span style="color: #228b22;">Either</span> <span style="color: #228b22;">String</span> <span style="color: #228b22;">Int</span>
<span style="color: #228b22;">Either</span> <span style="color: #228b22;">String</span> <span style="color: #228b22;">Int</span> <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">*</span>
</pre>

<p>
      <code>Either</code> を <code>Functor</code> 型クラスにしたときに部分適用を使いましたね．
      なぜなら， <code>Functor</code> は，型引数を1つ取るのに対して， <code>Either</code> は2つだったからですよね．
      言い換えると， <code>Functor</code> は <code>* -&gt; *</code> なるカインドを欲っしています．
      しかし， <code>Either</code> は， <code>* -&gt; * -&gt; *</code> なので，
      <code>Either</code> に部分適用させて <code>* -&gt; *</code> を得るのです．
</p>
<p>      
      ここで，もう一度 <code>Functor</code> の定義について見てみます．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">class</span> <span style="color: #228b22;">Functor</span> f <span style="color: #7f007f;">where</span>   
  fmap <span style="color: #a0522d;">::</span> (a <span style="color: #a0522d;">-&gt;</span> b) <span style="color: #a0522d;">-&gt;</span> f a <span style="color: #a0522d;">-&gt;</span> f b        
</pre>

<p>
      <code>f</code> なる型引数は，1つの具象データ型を引数に取って，
      具象データ型を作ることが分かります．
</p>
<p>
      ここまで学んだ知識を使えば，
      <code>Functor</code> と友達になりたい型は， <code>* -&gt; *</code> というカインドを持たなければならないと分かります．
</p>
<p>
      カインドを意識して，何か作ってみましょう．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">class</span> <span style="color: #228b22;">Tofu</span> t <span style="color: #7f007f;">where</span>  
  tofu <span style="color: #a0522d;">::</span> j a <span style="color: #a0522d;">-&gt;</span> t a j  
</pre>

<ul>
<li><code>j a</code> は <code>tofu</code> の引数なので，具象データ型のはずです．
        つまり， <code>*</code> です． <code>a</code> が <code>*</code> だと仮定すると，
        <code>j</code> は <code>* -&gt; *</code> です．
</li>
<li><code>t a j</code> もまた <code>*</code> であるはずです．
</li>
<li><code>a</code> は <code>*</code> で， <code>j</code> は <code>* -&gt; *</code> なので，
        <code>t</code> は <code>* -&gt; (* -&gt; *) -&gt; *</code> でしょう．
</li>
</ul>

<p>      OK．では， <code>* -&gt; (* -&gt; *) -&gt; *</code> なるカインドを持つ型を作ってみましょう．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">data</span> <span style="color: #228b22;">Frank</span> a b  <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">::</span> b a} <span style="color: #7f007f;">deriving</span> (<span style="color: #228b22;">Show</span>)
</pre>

<p>
      この代数データ型 (ADT: algebraic data type) のフィールドは，データを保持するのに利用されるので，
      カインド <code>*</code> でなければなりません．
      つまり <code>a</code> を <code>*</code> だとすると， <code>b</code> は 1つの型引数を取るので， <code>* -&gt; *</code> となります．
      <code>Frank</code> は， <code>a</code> と <code>b</code> を引数として取るので， <code>Frank</code> 
      は <code>* -&gt; (* -&gt; *) -&gt; *</code> となります．ここで，最初の <code>*</code> は <code>a</code> で， <code>(* -&gt; *)</code> は， <code>b</code>
      です． ここで <code>Frank</code> 型の値を定義してその型をチェックしてみましょう．
</p>



<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>t <span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Just</span> <span style="color: #8b2252;">"HAHA"</span>}
<span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Just</span> <span style="color: #8b2252;">"HAHA"</span>} <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Frank</span> [<span style="color: #228b22;">Char</span>] <span style="color: #228b22;">Maybe</span>
ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>t <span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Node</span> <span style="color: #8b2252;">'a'</span> <span style="color: #228b22;">EmptyTree</span> <span style="color: #228b22;">EmptyTree</span>}
<span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Node</span> <span style="color: #8b2252;">'a'</span> <span style="color: #228b22;">EmptyTree</span> <span style="color: #228b22;">EmptyTree</span>} <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Frank</span> <span style="color: #228b22;">Char</span> <span style="color: #228b22;">Tree</span>
ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>t <span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"YES"</span>}
<span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"YES"</span>} <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Frank</span> <span style="color: #228b22;">Char</span> <span style="color: #228b22;">[]</span>
</pre>


<p>
      <code>frankField</code> は <code>a b</code> なる型なので，値の型も似た形になるはず．
      <code>たとえば Just "HAHA" で</code> <code>Maybe [Char]</code> 型や <code>['Y', 'E', 'S']</code> で <code>[Char]</code> 型のような値を持つことができます．
      <code>Frank</code> 型の値は， <code>Frank</code> のカインドと一致しています． <code>[Char]</code> は， <code>*</code> というカインドで，
      <code>Maybe</code> は， <code>* -&gt; *</code> です．
      全ての <code>Frank blah blaah</code> のカインドは， <code>*</code> です．
</p>
<p>      
      <code>Frank</code> を <code>Tofu</code> のインスタンスにするのは簡単です． <code>tofu</code> は <code>j a</code> を取って，(例えば <code>Maybe Int</code>) そして，
      <code>t a j</code> を返します．したがって， <code>Frank</code> を <code>t</code> (原文は <code>j</code> だが，おそらく間違い) と置けば，
      結果の型は <code>Frank Int Maybe</code> です．
</p>



<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">Tofu</span> <span style="color: #228b22;">Frank</span> <span style="color: #7f007f;">where</span>
  tofu x <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Frank</span> x
</pre>



<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> tofu (<span style="color: #228b22;">Just</span> <span style="color: #8b2252;">'a'</span>) <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Frank</span> <span style="color: #228b22;">Char</span> <span style="color: #228b22;">Maybe</span>
<span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Just</span> <span style="color: #8b2252;">'a'</span>}
ghci<span style="color: #0000ff;">&gt;</span> tofu [<span style="color: #8b2252;">"HELLO"</span>] <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Frank</span> [<span style="color: #228b22;">Char</span>] <span style="color: #228b22;">[]</span>
<span style="color: #228b22;">Frank</span> {frankField <span style="color: #a0522d;">=</span> [<span style="color: #8b2252;">"HELLO"</span>]}
ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>t <span style="color: #228b22;">Frank</span> (<span style="color: #228b22;">Just</span> <span style="color: #8b2252;">"HAHA"</span>)
<span style="color: #228b22;">Frank</span> (<span style="color: #228b22;">Just</span> <span style="color: #8b2252;">"HAHA"</span>) <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Frank</span> [<span style="color: #228b22;">Char</span>] <span style="color: #228b22;">Maybe</span>
</pre>


<p>
      もう少し訓練してみます．
</p>



<pre class="src src-haskell"><span style="color: #7f007f;">data</span> <span style="color: #228b22;">Barry</span> t k p <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Barry</span> { yabba <span style="color: #a0522d;">::</span> p, dabba <span style="color: #a0522d;">::</span> t k }
</pre>

<p>
      これを <code>Functor</code> の一員にしたいとします． <code>Functor</code> のカインドは， <code>* -&gt; *</code>  ですが，
      <code>Barry</code> は，違います． <code>Barry</code> のカインドは何でしょうか?
      <code>something -&gt; something -&gt; something -&gt; *</code> となります．
      <code>p</code> は <code>*</code> でしょうね(ADTのフィールドなので)．
      <code>k</code> も <code>*</code> と仮定すると，
      <code>t</code> は <code>* -&gt; *</code> です．
      <code>something</code> を置き換えると，
      <code>(* -&gt; *) -&gt; * -&gt; * -&gt; *</code> です．GHCI で調べてみると，
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>k <span style="color: #228b22;">Barry</span>
<span style="color: #228b22;">Barry</span> <span style="color: #a0522d;">::</span> (<span style="color: #a0522d;">*</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #a0522d;">*</span>) <span style="color: #a0522d;">-&gt;</span> <span style="color: #a0522d;">*</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #a0522d;">*</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #a0522d;">*</span>
</pre>

<p>
      思った通りだ．満足．
</p>
<p>      
      そうすると， <code>Functor</code> の要求するカインド <code>* -&gt; *</code> に合わせるためには，最初の2つを食べさせことになるので，
      インスタンス定義の書き出しは，以下のようになるはず:
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">Functor</span> (<span style="color: #228b22;">Barry</span> a b) <span style="color: #7f007f;">where</span><span style="color: #a0522d;">...</span>
</pre>


<p>
      <code>fmap</code> の定義を <code>Barry</code> 用だと思って眺めると，
      <code>fmap :: (a -&gt; b) -&gt; Barry c d a -&gt; Barry c d b</code> のように見える．
      <code>Functor</code> の <code>f</code> を <code>Barry c d</code> に置き換えただけ．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">instance</span> <span style="color: #228b22;">Functor</span> (<span style="color: #228b22;">Barry</span> a b) <span style="color: #7f007f;">where</span>
  fmap f (<span style="color: #228b22;">Barry</span> {yabba <span style="color: #a0522d;">=</span> x, dabba <span style="color: #a0522d;">=</span> y}) <span style="color: #a0522d;">=</span> 
    <span style="color: #228b22;">Barry</span> {yabba <span style="color: #a0522d;">=</span> f x, dabba <span style="color: #a0522d;">=</span> y}
</pre>

<p>
      <code>f</code> は，最初のフィールドにだけmapすると分かる．
</p>
</div>
</div>

</div>
