org/t08-08-09-nom.org
***  [[http://learnyouahaskell.com/input-and-output][9]]. Input and Output 
     Haskell は純粋関数型言語であると説明してきました．副作用がないということは素晴しいことです．
     しかし，もし関数がその副作用として世界を一切変えることが許されないとすれば，
     関数の実行結果をどうやって外界に知らせることができるのでしょうか．
     結果を出力するということは外部デバイスの状態を変化させてしまうということです．

     失望することはありません．Haskell では pure な関数とそうでない関数をきちんと分離するよい仕組みが用意されているのです．

