html/t08-08-09-nom.html

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><a href="http://learnyouahaskell.com/input-and-output">9</a>. Input and Output</h3>
<div class="outline-text-3" id="text-1-2">

<p>     Haskell は純粋関数型言語であると説明してきました．副作用がないということは素晴しいことです．
     しかし，もし関数がその副作用として世界を一切変えることが許されないとすれば，
     関数の実行結果をどうやって外界に知らせることができるのでしょうか．
     結果を出力するということは外部デバイスの状態を変化させてしまうということです．
</p>
<p>
     失望することはありません．Haskell では pure な関数とそうでない関数をきちんと分離するよい仕組みが用意されているのです．
</p>

</div>
