org/t08-08-09-nom.org
***** Hello, world!
      [[http://learnyouahaskell.com/input-and-output#hello-world][(http://learnyouahaskell.com/input-and-output#hello-world)]] 

      ここでやっと，(GHCI) ではなく，リアルに(それ単体で)動く Haskell プログラムを作ることにします!!
      好きなエディタで，以下のファイルを作ります．
      #+BEGIN_SRC haskell
        main = putStrLn "hello, world"
      #+END_SRC
      =main= という関数を定義しました．
      何の変哲もないもの(run of the mill)に見えます．
      =helloworld.hs= というファイルにセーブして，コンパイルします．
      #+BEGIN_EXAMPLE
        $ ghc --make helloworld
        [1 of 1] Compiling Main ( helloworld.hs, helloworld.o )
        Linking helloworld ...
      #+END_EXAMPLE
      おっけー．
      #+BEGIN_EXAMPLE
        $ ./helloworld
        hello, world
      #+END_EXAMPLE
      やった!! 何て退屈なんだ!!
      =putStrLn= の型を調べます．
      #+BEGIN_SRC haskell
        ghci> :t putStrLn
        putStrLn :: String -> IO ()
        ghci> :t putStrLn "hello, world"
        putStrLn "hello, world" :: IO ()
      #+END_SRC
      =printStrLn= は特に意味のある戻り値を持たないので，
      ダミーの戻り値として， =()= が戻って来ます．

      では，I/O アクションは，いつ実行されるのでしょうか．そこで，
      =main= という名前が意味を持ちます．
      I/O アクションというのは，それに =main= 
      という名前を付けてコンパイル，実行されたときに実施されます．

      プログラム中で1つのI/Oアクションだけという訳にはいかないでしょう．
      そのために，I/O には， =do= という構文があって，複数のI/Oを1つにくっつけます．
      #+BEGIN_SRC haskell
        main = do
          putStrLn "Hello, what's your name?"
          name <- getLine
          putStrLn ("Hey " ++ name ++ ", you rock!")
      #+END_SRC
      この表現は，命令型プログラムに非常に近いですね．
      =do= は，中の最後の =IO ()= を戻り値にするので，型は =IO ()= です．

      =main= は =main :: IO something= という型シグネチャを持ちます．
      =something= は何らかの具象データ型です．
      通常，プログラム中で  =main= に明示的に型を宣言したりはしません．
      ここで気になるのは2行目: 
      : name <- getLine
      これは， 1行読んで， =name= に格納しているように見えます．
      では， =getLine= の型は?
      #+BEGIN_SRC haskell
        ghci> :t getLine
        getLine :: IO String
      #+END_SRC
      =getLine= は， =String= を結果として持つ I/O アクションです．
      I/O アクションは，脚の付いた箱のようなもので，
      現実世界に出掛けて行って何らかの仕事をして，結果を箱に入れて帰ってきます．
      箱の中から値を取り出すには =<-= を使います．

      そして，I/O アクションからデータを持ち出したいなら，
      それは，別の I/O アクションの中に居るときだけなのです．
      これによって，Haskell は純粋でないコードを純粋な部分から分離しているのです．

      =getLine= は純粋ではありません．なぜなら2度実行すると同じ値が返ってくるとは限らないからです．
      そのため，IO 構成子によって汚染されているといい，I/O コードの中でしかその値を取り出すことができません．
      I/O コード内での演算は，I/O 汚染されているコードから得られる結果なので，これも汚染されていると考えることができます．

      ここで， *汚染されている* といいましたが，I/Oの結果を純粋関数の入力として全く使用しないということではありません．
      =name= は =<-= によって，単なる =String= となっています．
      あなたの名前 =name= を引数として将来を予言する =tellForetune= という関数があると，
      #+BEGIN_SRC haskell
        main = do
          putStrLn "Hello, what's your name?"
          name <- getLine
          putStrLn $ "this is your future: " ++ 
            tellFortune name
      #+END_SRC
      =tellForetune= は I/O のことについては一切知る必要がありません．
      =String -> String= な関数です．

      では，これは正しい?
      #+BEGIN_SRC haskell
        nameTag = "Hello, my name is " ++ getLine
      #+END_SRC
      いいえ． =++= は =String= と =IO String= を結合できないです．
      まず =IO String= を =String= にしなければいけません． =name <- getLine= のような操作が必要になるわけですが，
      それは，I/O アクションの中だけでしかできなのです．
      純粋ではない値を扱うためには，純粋ではない環境の中だけに限られるのです．
      純粋でない環境は，拡散していくので，I/O アクションをできるだけ狭い範囲に閉じ込めることが最善の策 (in our best interest)
      なのです．

      I/O アクションは，結果をその中に閉じ込めて戻ってきます．すべての値を取り出すように以下のようにも書けます．
      #+BEGIN_SRC haskell
        main = do
          foo <- putStrLn "Hello, what's your name?"
          name <- getLine
          putStrLn ("Hey " ++ name ++ ", you rock!")
      #+END_SRC
      しかし， =putStrLn= からは =()= が返ってくるだけなので，ムダなのでやりません．
      最後の行には =<-= を使うことができないのですが，この理由は後にモナドの所で説明します．

      初心者がよく間違う例:
      #+BEGIN_SRC haskell
        name = getLine
      #+END_SRC
      これは，単に =getLine= に =name= という別名を付けているだけになります．
      I/O アクションが実際に実行されるのは，
      + main という名前が与えられたとき
      + do ブロックで作った大きな I/O アクションの中にあるとき
      do ブロックは，いくつかの I/O をアクションを1つにまとめることができて，
      それによってまとめられた I/O アクションは，また別の do ブロックの一部になったりします．
      いずれにしても，最終的に =main= につながっていれば，その I/O は実行されます．

      もう1つ GHCI で I/O アクションを入力した場合です．
      #+BEGIN_SRC haskell
        ghci> putStrLn "HEEY"  
        HEEY        
      #+END_SRC

      以下，let を使った， do ブロックの中で =let= を並べるいい例です．
      #+BEGIN_SRC haskell
        import Data.Char
        
        main = do
          putStrLn "What's your first name?"
          firstName <- getLine
          putStrLn "What's your last name?"
          lastName <- getLine
          let bigFirstName = map toUpper firstName
              bigLastName = map toUpper lastName
          putStrLn $ "hey " ++ bigFirstName ++ 
            " " ++ bigLastName ++ ", how are you?"
      #+END_SRC

      次の例は，1行読込んで，単語を逆順にして出力するプログラムです．
      #+BEGIN_SRC haskell
        main = do   
          line <- getLine  
          if null line  
            then return ()  
            else do  
              putStrLn $ reverseWords line  
              main  
        
        reverseWords :: String -> String  
        reverseWords = unwords . map reverse . words  
      #+END_SRC

      Tips:
      #+BEGIN_EXAMPLE
        ghc --make helloworld
        ./helloworld
      #+END_EXAMPLE
      の代わりに
      #+BEGIN_EXAMPLE
        runhaskell helloworld.hs
      #+END_EXAMPLE
      としてもいいです．

      =reverseWords= は，こうも書けます:
      #+BEGIN_SRC haskell
        reverseWords st = unwords (map reverse (words st))
      #+END_SRC

      次に =main= を見てみます．
      Haskell の =if= は，かならず =else= が必要でした．しかも同じ型を返すので，
      =if= /condition/ =then= /IO action/ =else= /IO action/ の形でなければなりません．
      =else= の後には，ただ1つの I/O アクションが来るので，以下のように書けます．
      #+BEGIN_SRC haskell
        else (do
          putStrLn $ reverseWords line
          main)
      #+END_SRC
      =null line= が true だった場合，つまり =return ()= は何をするのでしょうか．
      =return ()= は命令型のそれとは全く異なるものです．
      =return= は， 純粋な値を IO の箱で包むはたらきをします．
      つまり， =(return "hahaha")= は， =IO String= の型を持ちます．

      =return= は do ブロックを終わらせる働きはありません．
      以下のプログラムは普通に最後まで実行されます．
      #+BEGIN_SRC haskell
        main = do
          return ()
          return "HAHAHA"
          line <- getLine
          return "BLAH BLAH BLAH"
          return 4
          putStrLn line
      #+END_SRC

      I/O の箱を作る =return= と，そこから値を取り出す  =<-= 使って，以下のようにも書けます．
      #+BEGIN_SRC haskell
        main = do
          a <- return "hell"
          b <- return "yeah!"
          putStrLn $ a ++ " " ++ b
      #+END_SRC
      しかし，これは冗長です． =let= を使って，以下のように書けます:
      #+BEGIN_SRC haskell
        main = do
          let a = "hell"
              b = "yeah"
          putStrLn $ a ++ " " ++ b
      #+END_SRC

      ここからは，I/O を扱う際に便利な関数をいくつか見て行きましょう．
