html/t08-08-09-nom.html

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Hello, world!</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>      <a href="http://learnyouahaskell.com/input-and-output#hello-world">(http://learnyouahaskell.com/input-and-output#hello-world)</a> 
</p>
<p>
      ここでやっと，(GHCI) ではなく，リアルに(それ単体で)動く Haskell プログラムを作ることにします!!
      好きなエディタで，以下のファイルを作ります．
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> putStrLn <span style="color: #8b2252;">"hello, world"</span>
</pre>

<p>
      <code>main</code> という関数を定義しました．
      何の変哲もないもの(run of the mill)に見えます．
      <code>helloworld.hs</code> というファイルにセーブして，コンパイルします．
</p>


<pre class="example">$ ghc --make helloworld
[1 of 1] Compiling Main ( helloworld.hs, helloworld.o )
Linking helloworld ...
</pre>

<p>
      おっけー．
</p>


<pre class="example">$ ./helloworld
hello, world
</pre>

<p>
      やった!! 何て退屈なんだ!!
      <code>putStrLn</code> の型を調べます．
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>t putStrLn
<span style="color: #0000ff;">putStrLn</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">String</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">IO</span> <span style="color: #228b22;">()</span>
ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>t putStrLn <span style="color: #8b2252;">"hello, world"</span>
<span style="color: #0000ff;">putStrLn</span> <span style="color: #8b2252;">"hello, world"</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">IO</span> <span style="color: #228b22;">()</span>
</pre>

<p>
      <code>printStrLn</code> は特に意味のある戻り値を持たないので，
      ダミーの戻り値として， <code>()</code> が戻って来ます．
</p>
<p>
      では，I/O アクションは，いつ実行されるのでしょうか．そこで，
      <code>main</code> という名前が意味を持ちます．
      I/O アクションというのは，それに <code>main</code> 
      という名前を付けてコンパイル，実行されたときに実施されます．
</p>
<p>
      プログラム中で1つのI/Oアクションだけという訳にはいかないでしょう．
      そのために，I/O には， <code>do</code> という構文があって，複数のI/Oを1つにくっつけます．
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  putStrLn <span style="color: #8b2252;">"Hello, what's your name?"</span>
  name <span style="color: #a0522d;">&lt;-</span> getLine
  putStrLn (<span style="color: #8b2252;">"Hey "</span> <span style="color: #a0522d;">++</span> name <span style="color: #a0522d;">++</span> <span style="color: #8b2252;">", you rock!"</span>)
</pre>

<p>
      この表現は，命令型プログラムに非常に近いですね．
      <code>do</code> は，中の最後の <code>IO ()</code> を戻り値にするので，型は <code>IO ()</code> です．
</p>
<p>
      <code>main</code> は <code>main :: IO something</code> という型シグネチャを持ちます．
      <code>something</code> は何らかの具象データ型です．
      通常，プログラム中で  <code>main</code> に明示的に型を宣言したりはしません．
      ここで気になるのは2行目: 
</p><pre class="example">
name &lt;- getLine
</pre>

<p>      これは， 1行読んで， <code>name</code> に格納しているように見えます．
      では， <code>getLine</code> の型は?
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> <span style="color: #228b22;">:</span>t getLine
<span style="color: #0000ff;">getLine</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">IO</span> <span style="color: #228b22;">String</span>
</pre>

<p>
      <code>getLine</code> は， <code>String</code> を結果として持つ I/O アクションです．
      I/O アクションは，脚の付いた箱のようなもので，
      現実世界に出掛けて行って何らかの仕事をして，結果を箱に入れて帰ってきます．
      箱の中から値を取り出すには <code>&lt;-</code> を使います．
</p>
<p>
      そして，I/O アクションからデータを持ち出したいなら，
      それは，別の I/O アクションの中に居るときだけなのです．
      これによって，Haskell は純粋でないコードを純粋な部分から分離しているのです．
</p>
<p>
      <code>getLine</code> は純粋ではありません．なぜなら2度実行すると同じ値が返ってくるとは限らないからです．
      そのため，IO 構成子によって汚染されているといい，I/O コードの中でしかその値を取り出すことができません．
      I/O コード内での演算は，I/O 汚染されているコードから得られる結果なので，これも汚染されていると考えることができます．
</p>
<p>
      ここで， <b>汚染されている</b> といいましたが，I/Oの結果を純粋関数の入力として全く使用しないということではありません．
      <code>name</code> は <code>&lt;-</code> によって，単なる <code>String</code> となっています．
      あなたの名前 <code>name</code> を引数として将来を予言する <code>tellForetune</code> という関数があると，
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  putStrLn <span style="color: #8b2252;">"Hello, what's your name?"</span>
  name <span style="color: #a0522d;">&lt;-</span> getLine
  putStrLn <span style="color: #a0522d;">$</span> <span style="color: #8b2252;">"this is your future: "</span> <span style="color: #a0522d;">++</span> 
    tellFortune name
</pre>

<p>
      <code>tellForetune</code> は I/O のことについては一切知る必要がありません．
      <code>String -&gt; String</code> な関数です．
</p>
<p>
      では，これは正しい?
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">nameTag</span> <span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"Hello, my name is "</span> <span style="color: #a0522d;">++</span> getLine
</pre>

<p>
      いいえ． <code>++</code> は <code>String</code> と <code>IO String</code> を結合できないです．
      まず <code>IO String</code> を <code>String</code> にしなければいけません． <code>name &lt;- getLine</code> のような操作が必要になるわけですが，
      それは，I/O アクションの中だけでしかできなのです．
      純粋ではない値を扱うためには，純粋ではない環境の中だけに限られるのです．
      純粋でない環境は，拡散していくので，I/O アクションをできるだけ狭い範囲に閉じ込めることが最善の策 (in our best interest)
      なのです．
</p>
<p>
      I/O アクションは，結果をその中に閉じ込めて戻ってきます．すべての値を取り出すように以下のようにも書けます．
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  foo <span style="color: #a0522d;">&lt;-</span> putStrLn <span style="color: #8b2252;">"Hello, what's your name?"</span>
  name <span style="color: #a0522d;">&lt;-</span> getLine
  putStrLn (<span style="color: #8b2252;">"Hey "</span> <span style="color: #a0522d;">++</span> name <span style="color: #a0522d;">++</span> <span style="color: #8b2252;">", you rock!"</span>)
</pre>

<p>
      しかし， <code>putStrLn</code> からは <code>()</code> が返ってくるだけなので，ムダなのでやりません．
      最後の行には <code>&lt;-</code> を使うことができないのですが，この理由は後にモナドの所で説明します．
</p>
<p>
      初心者がよく間違う例:
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">name</span> <span style="color: #a0522d;">=</span> getLine
</pre>

<p>
      これは，単に <code>getLine</code> に <code>name</code> という別名を付けているだけになります．
      I/O アクションが実際に実行されるのは，
</p><ul>
<li>main という名前が与えられたとき
</li>
<li>do ブロックで作った大きな I/O アクションの中にあるとき
</li>
</ul>

<p>      do ブロックは，いくつかの I/O をアクションを1つにまとめることができて，
      それによってまとめられた I/O アクションは，また別の do ブロックの一部になったりします．
      いずれにしても，最終的に <code>main</code> につながっていれば，その I/O は実行されます．
</p>
<p>
      もう1つ GHCI で I/O アクションを入力した場合です．
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> putStrLn <span style="color: #8b2252;">"HEEY"</span>  
<span style="color: #228b22;">HEEY</span>        
</pre>


<p>
      以下，let を使った， do ブロックの中で <code>let</code> を並べるいい例です．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">import</span> <span style="color: #228b22;">Data.Char</span>

<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  putStrLn <span style="color: #8b2252;">"What's your first name?"</span>
  firstName <span style="color: #a0522d;">&lt;-</span> getLine
  putStrLn <span style="color: #8b2252;">"What's your last name?"</span>
  lastName <span style="color: #a0522d;">&lt;-</span> getLine
  <span style="color: #7f007f;">let</span> bigFirstName <span style="color: #a0522d;">=</span> map toUpper firstName
      bigLastName <span style="color: #a0522d;">=</span> map toUpper lastName
  putStrLn <span style="color: #a0522d;">$</span> <span style="color: #8b2252;">"hey "</span> <span style="color: #a0522d;">++</span> bigFirstName <span style="color: #a0522d;">++</span> 
    <span style="color: #8b2252;">" "</span> <span style="color: #a0522d;">++</span> bigLastName <span style="color: #a0522d;">++</span> <span style="color: #8b2252;">", how are you?"</span>
</pre>


<p>
      次の例は，1行読込んで，単語を逆順にして出力するプログラムです．
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>   
  line <span style="color: #a0522d;">&lt;-</span> getLine  
  <span style="color: #7f007f;">if</span> null line  
    <span style="color: #7f007f;">then</span> return <span style="color: #228b22;">()</span>  
    <span style="color: #7f007f;">else</span> <span style="color: #7f007f;">do</span>  
      putStrLn <span style="color: #a0522d;">$</span> reverseWords line  
      main  

<span style="color: #0000ff;">reverseWords</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">String</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">String</span>  
<span style="color: #0000ff;">reverseWords</span> <span style="color: #a0522d;">=</span> unwords <span style="color: #a0522d;">.</span> map reverse <span style="color: #a0522d;">.</span> words  
</pre>


<p>
      Tips:
</p>


<pre class="example">ghc --make helloworld
./helloworld
</pre>

<p>
      の代わりに
</p>


<pre class="example">runhaskell helloworld.hs
</pre>

<p>
      としてもいいです．
</p>
<p>
      <code>reverseWords</code> は，こうも書けます:
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">reverseWords</span> st <span style="color: #a0522d;">=</span> unwords (map reverse (words st))
</pre>


<p>
      次に <code>main</code> を見てみます．
      Haskell の <code>if</code> は，かならず <code>else</code> が必要でした．しかも同じ型を返すので，
      <code>if</code> <i>condition</i> <code>then</code> <i>IO action</i> <code>else</code> <i>IO action</i> の形でなければなりません．
      <code>else</code> の後には，ただ1つの I/O アクションが来るので，以下のように書けます．
</p>


<pre class="src src-haskell"><span style="color: #7f007f;">else</span> (<span style="color: #7f007f;">do</span>
  putStrLn <span style="color: #a0522d;">$</span> reverseWords line
  main)
</pre>

<p>
      <code>null line</code> が true だった場合，つまり <code>return ()</code> は何をするのでしょうか．
      <code>return ()</code> は命令型のそれとは全く異なるものです．
      <code>return</code> は， 純粋な値を IO の箱で包むはたらきをします．
      つまり， <code>(return "hahaha")</code> は， <code>IO String</code> の型を持ちます．
</p>
<p>
      <code>return</code> は do ブロックを終わらせる働きはありません．
      以下のプログラムは普通に最後まで実行されます．
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  return <span style="color: #228b22;">()</span>
  return <span style="color: #8b2252;">"HAHAHA"</span>
  line <span style="color: #a0522d;">&lt;-</span> getLine
  return <span style="color: #8b2252;">"BLAH BLAH BLAH"</span>
  return 4
  putStrLn line
</pre>


<p>
      I/O の箱を作る <code>return</code> と，そこから値を取り出す  <code>&lt;-</code> 使って，以下のようにも書けます．
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  a <span style="color: #a0522d;">&lt;-</span> return <span style="color: #8b2252;">"hell"</span>
  b <span style="color: #a0522d;">&lt;-</span> return <span style="color: #8b2252;">"yeah!"</span>
  putStrLn <span style="color: #a0522d;">$</span> a <span style="color: #a0522d;">++</span> <span style="color: #8b2252;">" "</span> <span style="color: #a0522d;">++</span> b
</pre>

<p>
      しかし，これは冗長です． <code>let</code> を使って，以下のように書けます:
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  <span style="color: #7f007f;">let</span> a <span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"hell"</span>
      b <span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"yeah"</span>
  putStrLn <span style="color: #a0522d;">$</span> a <span style="color: #a0522d;">++</span> <span style="color: #8b2252;">" "</span> <span style="color: #a0522d;">++</span> b
</pre>


<p>
      ここからは，I/O を扱う際に便利な関数をいくつか見て行きましょう．
</p><ul>
<li id="sec-1-2-1-1">putStr<br/>
