org/t08-08-09-nom.org
******* putStr
        =putStrLn= の改行なし版
        #+BEGIN_SRC haskell
          main = do putStr "Hey, "
                    putStr "I'm "
                    putStrLn "Andy!"
        #+END_SRC
        実行結果:
        #+BEGIN_EXAMPLE
          $ runhaskell putstr_test.hs
          Hey, I'm Andy!
        #+END_EXAMPLE
        
******* putChar
        1文字出力
        #+BEGIN_SRC haskell
          main = do putChar 't'
                    putChar 'e'
                    putChar 'h'
        #+END_SRC
        実行結果:
        #+BEGIN_EXAMPLE
          $ runhaskell putchar_test.hs
          teh
        #+END_EXAMPLE
        =putStr= は， =putChar= によって再帰的に定義されています．基底部は，空文字列です．
        #+BEGIN_SRC haskell
          putStr :: String -> IO ()
            putStr [] = return ()
            putStr (x:xs) = do
              putChar x
              putStr xs
        #+END_SRC

******* print 
        =Show= 型クラスに属する値(つまり自身の文字列表現を持っている型)を引数に取って，
        =show= を呼び出し，結果の文字列を表示します．
        つまり， =putstrLn .show= とほぼ同じです．

        #+BEGIN_SRC haskell
          main = do print True  
                    print 2  
                    print "haha"  
                    print 3.2  
                    print [3,4,3]
        #+END_SRC
        実行結果:
        #+BEGIN_EXAMPLE
          $ runhaskell print_test.hs
          True  
          2  
          "haha"  
          3.2  
          [3,4,3]
        #+END_EXAMPLE
        これはとっても便利．
        GHCI 上での実行結果表示には， =print= が使われています．
        #+BEGIN_SRC haskell
          ghci> 3
          3
          ghci> print 3
          3
          ghci> map (++"!") ["hey","ho","woo"]
          ["hey!","ho!","woo!"]
          ghci> print (map (++"!") ["hey","ho","woo"])
          ["hey!","ho!","woo!"]
        #+END_SRC

******* getChar
        1文字入力関数です．
        =getChar :: IO Char= という型シグネチャを持ちます．
        バッファリングのため，ユーザがリターンキーを叩くまで読まれないので注意．
        #+BEGIN_SRC haskell
          main = do
            c <- getChar
            if c /= ' '
              then do
                putChar c  
                main  
              else return ()
        #+END_SRC
        実際に実行してみるといいよ．

******* when
        when は =Control.Monad= に定義されています (=import Control.Monad= してください)．
        真理値と I/O アクションを引数に取り，真理値が真の場合は I/O アクションを返し，
        偽の場合は， =return ()= します．
        #+BEGIN_SRC haskell
          import Control.Monad
          
          main = do
            c <- getChar
            when (c /= ' ') $ do
              putChar c
              main
        #+END_SRC
        =if= /something/ =then do= /some IO action/ =else return ()= のパターンを簡潔に書けます．

******* sequence 
        sequence は I/O アクションのリストを取って，それらを順番に実行するような I/O アクションを返します．
        その I/O アクションの結果は，個々の I/O アクションの実行結果のリストです．
        つまり =sequence :: [IO a] -> IO [a]= となります．
        #+BEGIN_SRC haskell
          main = do
            a <- getLine
            b <- getLine
            c <- getLine
            print [a,b,c]
        #+END_SRC
        =sequence= を使うと:
        #+BEGIN_SRC haskell
          main = do
          rs <- sequence [getLine, getLine, getLine]
          print rs
        #+END_SRC

        =sequence= をよく使う例は，リストに対して =print= や =getLine= をマップしたい場合です．
        =map print [1,2,3,4]= は I/O アクションを生成しません．これは，I/O アクションのリストを生成するだけで，
        =[print 1, print 2, print 3, print 4]= と書いたのと同じだからです．
        I/OアクションのリストをI/Oアクションに変換したいなら， =sequence= が必要です．
        #+BEGIN_SRC haskell
          ghci> sequence (map print [1,2,3,4,5])  
          1  
          2  
          3  
          4  
          5  
          [(),(),(),(),()]          
        #+END_SRC
******* mapM と mapM_
        I/O アクションを返すような関数をリストにマップして，
        結果をシーケンスにすることがよくあります．
        そのために =mapM= と =mapM_= が用意されています．
        =mapM_= は，I/O の結果を捨てます．
        #+BEGIN_SRC haskell
          ghci> mapM print [1,2,3]
          1
          2
          3
          [(),(),()]
          ghci> mapM_ print [1,2,3]
          1
          2
          3 
        #+END_SRC

******* forever
        I/O アクションを取り，それを永遠に繰り返す I/O アクションを返します．
        =Control.Monad= に属しています．
        #+BEGIN_SRC haskell
          import Control.Monad
          import Data.Char
          
          main = forever $ do
            putStr "Give me some input: "
            l <- getLine
            putStrLn $ map toUpper l
        #+END_SRC
        上の例は，ユーザからの入力を受け取り続けて，大文字にして返します．

