html/t08-08-09-nom.html
        <code>putStrLn</code> の改行なし版



<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span> putStr <span style="color: #8b2252;">"Hey, "</span>
          putStr <span style="color: #8b2252;">"I'm "</span>
          putStrLn <span style="color: #8b2252;">"Andy!"</span>
</pre>

<p>
        実行結果:
</p>


<pre class="example">$ runhaskell putstr_test.hs
Hey, I'm Andy!
</pre>


</li>
</ul>
<ul>
<li id="sec-1-2-1-2">putChar<br/>
        1文字出力



<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span> putChar <span style="color: #8b2252;">'t'</span>
          putChar <span style="color: #8b2252;">'e'</span>
          putChar <span style="color: #8b2252;">'h'</span>
</pre>

<p>
        実行結果:
</p>


<pre class="example">$ runhaskell putchar_test.hs
teh
</pre>

<p>
        <code>putStr</code> は， <code>putChar</code> によって再帰的に定義されています．基底部は，空文字列です．
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">putStr</span> <span style="color: #a0522d;">::</span> <span style="color: #228b22;">String</span> <span style="color: #a0522d;">-&gt;</span> <span style="color: #228b22;">IO</span> <span style="color: #228b22;">()</span>
  putStr <span style="color: #228b22;">[]</span> <span style="color: #a0522d;">=</span> return <span style="color: #228b22;">()</span>
  putStr (x<span style="color: #228b22;">:</span>xs) <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
    putChar x
    putStr xs
</pre>


</li>
</ul>
<ul>
<li id="sec-1-2-1-3">print<br/>
        <code>Show</code> 型クラスに属する値(つまり自身の文字列表現を持っている型)を引数に取って，
        <code>show</code> を呼び出し，結果の文字列を表示します．
        つまり， <code>putstrLn .show</code> とほぼ同じです．




<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span> print <span style="color: #228b22;">True</span>  
          print 2  
          print <span style="color: #8b2252;">"haha"</span>  
          print 3<span style="color: #a0522d;">.</span>2  
          print [3,4,3]
</pre>

<p>
        実行結果:
</p>


<pre class="example">$ runhaskell print_test.hs
True  
2  
"haha"  
3.2  
[3,4,3]
</pre>

<p>
        これはとっても便利．
        GHCI 上での実行結果表示には， <code>print</code> が使われています．
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> 3
3
ghci<span style="color: #0000ff;">&gt;</span> print 3
3
ghci<span style="color: #0000ff;">&gt;</span> map (<span style="color: #a0522d;">++</span><span style="color: #8b2252;">"!"</span>) [<span style="color: #8b2252;">"hey"</span>,<span style="color: #8b2252;">"ho"</span>,<span style="color: #8b2252;">"woo"</span>]
[<span style="color: #8b2252;">"hey!"</span>,<span style="color: #8b2252;">"ho!"</span>,<span style="color: #8b2252;">"woo!"</span>]
ghci<span style="color: #0000ff;">&gt;</span> print (map (<span style="color: #a0522d;">++</span><span style="color: #8b2252;">"!"</span>) [<span style="color: #8b2252;">"hey"</span>,<span style="color: #8b2252;">"ho"</span>,<span style="color: #8b2252;">"woo"</span>])
[<span style="color: #8b2252;">"hey!"</span>,<span style="color: #8b2252;">"ho!"</span>,<span style="color: #8b2252;">"woo!"</span>]
</pre>


</li>
</ul>
<ul>
<li id="sec-1-2-1-4">getChar<br/>
        1文字入力関数です．
        <code>getChar :: IO Char</code> という型シグネチャを持ちます．
        バッファリングのため，ユーザがリターンキーを叩くまで読まれないので注意．



<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  c <span style="color: #a0522d;">&lt;-</span> getChar
  <span style="color: #7f007f;">if</span> c <span style="color: #a0522d;">/=</span> <span style="color: #8b2252;">' '</span>
    <span style="color: #7f007f;">then</span> <span style="color: #7f007f;">do</span>
      putChar c  
      main  
    <span style="color: #7f007f;">else</span> return <span style="color: #228b22;">()</span>
</pre>

<p>
        実際に実行してみるといいよ．
</p>
</li>
</ul>
<ul>
<li id="sec-1-2-1-5">when<br/>
        when は <code>Control.Monad</code> に定義されています (<code>import Control.Monad</code> してください)．
        真理値と I/O アクションを引数に取り，真理値が真の場合は I/O アクションを返し，
        偽の場合は， <code>return ()</code> します．



<pre class="src src-haskell"><span style="color: #7f007f;">import</span> <span style="color: #228b22;">Control.Monad</span>

<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  c <span style="color: #a0522d;">&lt;-</span> getChar
  when (c <span style="color: #a0522d;">/=</span> <span style="color: #8b2252;">' '</span>) <span style="color: #a0522d;">$</span> <span style="color: #7f007f;">do</span>
    putChar c
    main
</pre>

<p>
        <code>if</code> <i>something</i> <code>then do</code> <i>some IO action</i> <code>else return ()</code> のパターンを簡潔に書けます．
</p>
</li>
</ul>
<ul>
<li id="sec-1-2-1-6">sequence<br/>
        sequence は I/O アクションのリストを取って，それらを順番に実行するような I/O アクションを返します．
        その I/O アクションの結果は，個々の I/O アクションの実行結果のリストです．
        つまり <code>sequence :: [IO a] -&gt; IO [a]</code> となります．



<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  a <span style="color: #a0522d;">&lt;-</span> getLine
  b <span style="color: #a0522d;">&lt;-</span> getLine
  c <span style="color: #a0522d;">&lt;-</span> getLine
  print [a,b,c]
</pre>

<p>
        <code>sequence</code> を使うと:
</p>


<pre class="src src-haskell"><span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
rs <span style="color: #a0522d;">&lt;-</span> sequence [getLine, getLine, getLine]
<span style="color: #0000ff;">print</span> rs
</pre>


<p>
        <code>sequence</code> をよく使う例は，リストに対して <code>print</code> や <code>getLine</code> をマップしたい場合です．
        <code>map print [1,2,3,4]</code> は I/O アクションを生成しません．これは，I/O アクションのリストを生成するだけで，
        <code>[print 1, print 2, print 3, print 4]</code> と書いたのと同じだからです．
        I/OアクションのリストをI/Oアクションに変換したいなら， <code>sequence</code> が必要です．
</p>


<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> sequence (map print [1,2,3,4,5])  
1  
2  
3  
4  
5  
[<span style="color: #228b22;">()</span>,<span style="color: #228b22;">()</span>,<span style="color: #228b22;">()</span>,<span style="color: #228b22;">()</span>,<span style="color: #228b22;">()</span>]          
</pre>

</li>
</ul>
<ul>
<li id="sec-1-2-1-7">mapM と mapM_<br/>
        I/O アクションを返すような関数をリストにマップして，
        結果をシーケンスにすることがよくあります．
        そのために <code>mapM</code> と <code>mapM_</code> が用意されています．
        <code>mapM_</code> は，I/O の結果を捨てます．



<pre class="src src-haskell">ghci<span style="color: #0000ff;">&gt;</span> mapM print [1,2,3]
1
2
3
[<span style="color: #228b22;">()</span>,<span style="color: #228b22;">()</span>,<span style="color: #228b22;">()</span>]
ghci<span style="color: #0000ff;">&gt;</span> mapM_ print [1,2,3]
1
2
3 
</pre>


</li>
</ul>
<ul>
<li id="sec-1-2-1-8">forever<br/>
        I/O アクションを取り，それを永遠に繰り返す I/O アクションを返します．
        <code>Control.Monad</code> に属しています．



<pre class="src src-haskell"><span style="color: #7f007f;">import</span> <span style="color: #228b22;">Control.Monad</span>
<span style="color: #7f007f;">import</span> <span style="color: #228b22;">Data.Char</span>

<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> forever <span style="color: #a0522d;">$</span> <span style="color: #7f007f;">do</span>
  putStr <span style="color: #8b2252;">"Give me some input: "</span>
  l <span style="color: #a0522d;">&lt;-</span> getLine
  putStrLn <span style="color: #a0522d;">$</span> map toUpper l
</pre>

<p>
        上の例は，ユーザからの入力を受け取り続けて，大文字にして返します．
</p>
</li>
</ul>
<ul>
<li id="sec-1-2-1-9">forM<br/>
