org/t08-08-09-nom.org
******* forM
        =forM= (=Control.Monad= に属しています)は， =mapM= に似ていますが，
        引数の順番が逆になっています．最初の引数は，リストで，2番目がリストにマップ適用したい関数です．
        何が有用なのでしょう．
        #+BEGIN_SRC haskell
          import Control.Monad
              
          main = do
            colors <- forM [1,2,3,4] (\a -> do
              putStrLn $ "Which color do you assoc with the num " 
                ++ show a ++ "?"
              color <- getLine
              return color)
            putStrLn "The colors you associate with 1,2,3,4 are: "
            mapM putStrLn colors
        #+END_SRC
        =(\a -> do ... )= は，数を取って I/O アクションを返す関数です．
        ここで，
        #+BEGIN_SRC haskell
          color <- getLine
          return color)
        #+END_SRC
        の部分は，冗長です． =<-= で取り出して， =return= でまた包んでいるからです．
        =getLine= だけで十分です．

        #+BEGIN_EXAMPLE
          $ runhaskell form_test.hs
          Which color do you associate with the number 1?
          white
          Which color do you associate with the number 2?
          blue
          Which color do you associate with the number 3?
          red
          Which color do you associate with the number 4?
          orange
          The colors that you associate with 1, 2, 3 and 4 are:
          white
          blue
          red
          orange
        #+END_EXAMPLE
        =forM= がなくても (=mapM= があれば) いいのですが， =forM= を使うと可読性が上がる場合があります．
        =do= の書式を使ってスポット的にマップしたい内容を(長々と)書きたい場合には =forM= が向いています．

        最後の1行は， =forM colors putStrLn= とも書けますね．

        I/O アクションは，Haskell の他の値と同じように関数の引数に取ったり，戻り値にしたりできます．
        違うのは， =main= 関数の下にあると (GHCI の行にあると) 実行されることです．
        それによって，画面に文字が出たり，スピーカから音が出たりするのです．
        個々のI/O アクションは，リアルワールドから取得した結果を箱に詰めて持ち帰るのです．

