html/t08-08-09-nom.html
        <code>forM</code> (<code>Control.Monad</code> に属しています)は， <code>mapM</code> に似ていますが，
        引数の順番が逆になっています．最初の引数は，リストで，2番目がリストにマップ適用したい関数です．
        何が有用なのでしょう．



<pre class="src src-haskell"><span style="color: #7f007f;">import</span> <span style="color: #228b22;">Control.Monad</span>

<span style="color: #0000ff;">main</span> <span style="color: #a0522d;">=</span> <span style="color: #7f007f;">do</span>
  colors <span style="color: #a0522d;">&lt;-</span> forM [1,2,3,4] (<span style="color: #a0522d;">\</span>a <span style="color: #a0522d;">-&gt;</span> <span style="color: #7f007f;">do</span>
    putStrLn <span style="color: #a0522d;">$</span> <span style="color: #8b2252;">"Which color do you assoc with the num "</span> 
      <span style="color: #a0522d;">++</span> show a <span style="color: #a0522d;">++</span> <span style="color: #8b2252;">"?"</span>
    color <span style="color: #a0522d;">&lt;-</span> getLine
    return color)
  putStrLn <span style="color: #8b2252;">"The colors you associate with 1,2,3,4 are: "</span>
  mapM putStrLn colors
</pre>

<p>
        <code>(\a -&gt; do ... )</code> は，数を取って I/O アクションを返す関数です．
        ここで，
</p>


<pre class="src src-haskell">color <span style="color: #a0522d;">&lt;-</span> getLine
<span style="color: #0000ff;">return</span> color)
</pre>

<p>
        の部分は，冗長です． <code>&lt;-</code> で取り出して， <code>return</code> でまた包んでいるからです．
        <code>getLine</code> だけで十分です．
</p>



<pre class="example">$ runhaskell form_test.hs
Which color do you associate with the number 1?
white
Which color do you associate with the number 2?
blue
Which color do you associate with the number 3?
red
Which color do you associate with the number 4?
orange
The colors that you associate with 1, 2, 3 and 4 are:
white
blue
red
orange
</pre>

<p>
        <code>forM</code> がなくても (<code>mapM</code> があれば) いいのですが， <code>forM</code> を使うと可読性が上がる場合があります．
        <code>do</code> の書式を使ってスポット的にマップしたい内容を(長々と)書きたい場合には <code>forM</code> が向いています．
</p>
<p>
        最後の1行は， <code>forM colors putStrLn</code> とも書けますね．
</p>
<p>
        I/O アクションは，Haskell の他の値と同じように関数の引数に取ったり，戻り値にしたりできます．
        違うのは， <code>main</code> 関数の下にあると (GHCI の行にあると) 実行されることです．
        それによって，画面に文字が出たり，スピーカから音が出たりするのです．
        個々のI/O アクションは，リアルワールドから取得した結果を箱に詰めて持ち帰るのです．
</p>
</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-25</p>
<p class="author">Author: 乃村 能成</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.8.11 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>


</div>
</body>
</html>
